finalExam/database-app-dev.tex
% Created 2022-06-20 一 01:58
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{xeCJK}
\author{werbinich(wyt)}
\date{\today}
\title{数据库应用开发复习笔记}
\hypersetup{
 pdfauthor={werbinich(wyt)},
 pdftitle={数据库应用开发复习笔记},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Part I}
\label{sec:orgc514395}
\begin{itemize}
\item \textbf{HTML/CSS/JS}
\begin{itemize}
\item HTML标记
\begin{itemize}
\item form     表单标记
\item table    表格标记
\item br       换行标记
\item td       列标记
\item tr       行标记
\item a        超链接标记
\item link     链入资源标记
\item div      分块标记
\item hidden   隐藏标记
\item img      图片标记
\item password 密码标记
\item herf     指定资源URL地址
\item src      图片属性
\end{itemize}
\item HTML标签值
\begin{itemize}
\item 提交按钮属性值      \uline{submit}
\item 单(多)选按钮选中    \uline{checked}
\item upload file       \uline{file}
\item 下拉列表option     \uline{selected}
\item 提交方式决定权      \uline{method}
\item 文本输入           \uline{text}
\item 提交给             \uline{action}
\item 当使用select时会   \uline{onChange}
\end{itemize}
\end{itemize}
\end{itemize}
\begin{verbatim}
<a herf="right.html" target="_blank">news</a>
\end{verbatim}
\begin{itemize}
\item CSS(层叠样式表)构成 \uline{选择器}, \uline{属性}, \uline{属性值}
\begin{itemize}
\item 选择器\{标记选择器, 类别选择器, id选择器\}
\item 类别选择器 .开始
\item jQuery   \$开始
\item 右移5px 下移 10px
\begin{verbatim}
p {background-position:5px -10px;}
\end{verbatim}
\end{itemize}
\item \emph{\texttt{selector\{attribute:value;...\}}}
\item js在执行数字和字符串相加时会将数字转换为字符串并且拼接在一起
\item alert方法包含在window对象中
\item jquery      的筛选分为 \{查找, 串联, 过滤\}
\item setInterval 提供定时调用功能
\item OnClick     单击按钮时处理函数
\item parseInt    字符串转数值函数
\end{itemize}
\section{Part II}
\label{sec:orgae0d5cd}
\begin{itemize}
\item \textbf{SQL}
\begin{itemize}
\item 安装sql时会默认创建一些数据库\{mysql, sys, information\textsubscript{schema}\}
\item 交叉连接
\begin{itemize}
\item 执行后对于参与交叉链接后的字段和
\end{itemize}
\item DBMS(DataBase Manage System) 是数据库管理系统的缩写
\item 四种连接
\begin{itemize}
\item 左连接 : 返回左表中与右表连接字段相等的的记录
\item 右连接 : 返回右表中与左表连接字段相等的的记录
\item 内连接 : 返回右表与左表连接字段相等的的记录
\item 全外连接: 返回左右所有的记录和左右相等的数据
\end{itemize}
\item select * frome table;表示选取所有所有字段
\item 属于DML(数据操纵语言)
\begin{itemize}
\item insert  插入 (insert into table(field,\ldots{})values(v1,\ldots{})(v2\ldots{})
\item update  更新 (update table set field = new-value,\ldots{} where cond)
\item delete  删除 (delete table's half alias from t1 tas1,\ldots{}where link-cond and filter-cond)
\end{itemize}
\item 数据定义语言DDL
\begin{itemize}
\item create  创建 (create databease if not exists name character set codeset;)
\item drop    删除 (drop  databease  if exists name;)
\item alter   修改 (alter table table-name change/modify column old-column new-column new-type \ldots{})
\end{itemize}
\item select   查询 (slelect field from name (where cond))
\item order by 排序  (select field from tn where order by \ldots{})
\item types    (int date(timestamp date) text character iamge real(float 精度6-7bit)))
\item 主键     唯一且非空
\item ON      设置从表连接的条件
\item project 投影
\item default port 3306
\item net start mysql 启动mysql服务
\item net stop  mysql 停止mysql服务
\item 域:属性的却只范围
\item Create PROCEDURE 存储过程PROCESS
\item 概念模式 表述数据的整体逻辑结构
\item $\backslash$'      转义'
\item E-R     实体-关系 概念模型 实体-属性-联系
\item LIMIT offset count  limit 5 10 表示6-15 通过它实现分页
\item where between start and end.
\item 几种模型
\begin{itemize}
\item n:1
\item n:m
\item 1:n
\end{itemize}
\item DECIMAL(length, accuracy)
\item 几个函数
\begin{itemize}
\item avg     平均
\item sum     求和
\item maxmin  最值
\item concat  字符串链接函数
\end{itemize}
\item having    连接查询和聚合函数
\item user table 保存用户名和密码
\item 子查询
\begin{itemize}
\item where 子查询
\item from  子查询
\end{itemize}
\item 关系别名:字段 元组别名:记录
\item DISTINCT 去除重复记录
\item 外连接分左右外连接
\item 建立外键约束会影响关联表的插入操作
\item union 联合查询
\item as    设置别名 可以用空格代替
\item GROUP\textsubscript{CONCAT} 聚合函数我们可以将分组后的字段值连接成为字符串
\item NULL  空值 在不匹配时会被设置
\item E-R 关系图中
\begin{itemize}
\item 实体对应数据表
\item 属性对应字段
\end{itemize}
\item ASC  默认排序关键字
\item
\end{itemize}
\end{itemize}
\begin{verbatim}
create table table-name(
    col type(int) primary key auto_increment,
    col2 type not null,
    col3 type unique,
)
\end{verbatim}
\begin{itemize}
\item 几种约束
\begin{itemize}
\item todo
\end{itemize}
\end{itemize}
\section{Part III}
\label{sec:org4afce88}
\begin{itemize}
\item JDBC(JAVA数据库连接) (package java.sql)
\begin{itemize}
\item step 00: create a Connection class.
\item step 01: create a PreparedStatement save sql.
\item step 11: execute sql. call preparedstatement.executeQuery()
\item step 10: release connection.
\end{itemize}
\item ResultSet
\begin{itemize}
\item next   judge is have next record
\end{itemize}
\item \textbf{还没有完成,完整版应该要在凌晨了.还没太学懂!不好意思哈!}
\end{itemize}
\section{Part IV}
\label{sec:org2843da8}
\begin{itemize}
\item \textbf{Servlet and Filter}
\begin{itemize}
\item 运行在Web服务器上的程序,可动态的收集数据是中间件,降低程序复杂性.
\item 生命周期:
\begin{itemize}
\item 初始化     init()    只调用一次 每个请求都会创建一个新的线程
\item 处理请求   service() 发送响应给客户端在适当的时候调用doGet,doPost,doPut,doDelete
\item 销毁      destroy() 生命周期结束时候调用
\end{itemize}
\item 需要在web.xml文件中添加
\end{itemize}
\end{itemize}
\begin{verbatim}
<web-app>
    <servlet>
            <servlet-name>name</servlet-name>
            <servlet-class>name</servlet-class>
    </servlet>
    <servlet-mapping>
            <servlet-name>name</servlet-name>
            <url-pattern>name</url-pattern>
    </servlet-mapping>
</web-app>
\end{verbatim}
\begin{itemize}
\item 这部分有点难!!! 要理解服务器处理请求的过程,以及产生的响应,过滤器是为了实现动态拦截和响应.
\item 错误和异常处理 error-page ..内置对象\ldots{} cookie 会话追踪.
\end{itemize}
\end{document}
